# Import pandas and load the data

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('ConstructionTimeSeriesDataV2.csv')
df.head()

,Month,Month-Year,Total Construction,Private Construction,Public Construction
0,1,Jan-02,59516,45273,14243
1,2,Feb-02,58588,44475,14113
2,3,Mar-02,63782,49396,14386
3,4,Apr-02,69504,53283,16221
4,5,May-02,73384,55009,18375

# Create function to Convert Month-Year Column 

... and a dictionary to help

In [3]:
date_data = {'Jan' : ('01', '31'), 'Feb' : ('02', '28'), 'Mar' : ('03', '31'), 'Apr' : ('04', '30'), 'May' : ('05', '31'), 'Jun' : ('06', '30'), 'Jul' : ('07', '31'), 'Aug' : ('08', '31'), 'Sep' : ('09', '30'), 'Oct' : ('10', '31'), 'Nov' : ('11', '30'), 'Dec' : ('12', '31')}

def to_data_range(date_str):
    return '20' + date_str[-2:] + '-' + date_data[date_str[:3]][0] + '-' + date_data[date_str[:3]][0]

# Create a New Column with Proper (string) Date Fromat

In [4]:
df['Date'] = df['Month-Year'].apply(to_data_range)

# Set Index to a Date Range

... and check to make sure DataFrame index is DatetimeIndex

In [5]:
df.index = pd.date_range(start=df['Date'].iloc[0], periods = df['Date'].shape[0], freq='M')

In [6]:
df.head()

,Month,Month-Year,Total Construction,Private Construction,Public Construction,Date
2002-01-31,1,Jan-02,59516,45273,14243,2002-01-01
2002-02-28,2,Feb-02,58588,44475,14113,2002-02-02
2002-03-31,3,Mar-02,63782,49396,14386,2002-03-03
2002-04-30,4,Apr-02,69504,53283,16221,2002-04-04
2002-05-31,5,May-02,73384,55009,18375,2002-05-05

In [7]:
type(df.index)

pandas.core.indexes.datetimes.DatetimeIndex